Desenvolvimento/Evidencias/Falha_ExecutarAnaliseCredito.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:proc="http://www.telefonica.com.br/ProcessoAnaliseCredito/" xmlns:par="http://www.telefonica.com.br/ParametrosProcessoAnaliseCredito">
   <soapenv:Header>
   <wsse:Security xmlns:wsse="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-secext-1.0.xsd">
         <wsse:UsernameToken wsu:Id="Id-0001427873415141-0000000076fdd541-1" xmlns:wsu="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd">
            <wsse:Username>weblogic</wsse:Username>
            <wsse:Password>welcome1</wsse:Password>
         </wsse:UsernameToken>
      </wsse:Security>
   </soapenv:Header>
   <soapenv:Body>
      <proc:executarProcessoAnaliseCreditoRequest>
         <par:cliente>
            <par:documento>
               <par:cpf>12312312312</par:cpf>
            </par:documento>
         </par:cliente>
      </proc:executarProcessoAnaliseCreditoRequest>
   </soapenv:Body>
</soapenv:Envelope>


<soapenv:Envelope xmlns:env="http://schemas.xmlsoap.org/soap/envelope/" xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/">
   <env:Header xmlns:wsa="http://www.w3.org/2005/08/addressing">
      <wsa:MessageID>urn:baadbf00-f45f-11e9-b5c4-56847afe9799</wsa:MessageID>
      <wsa:ReplyTo>
         <wsa:Address>http://www.w3.org/2005/08/addressing/anonymous</wsa:Address>
         <wsa:ReferenceParameters>
            <instra:tracking.ecid xmlns:instra="http://xmlns.oracle.com/sca/tracking/1.0">3c54df9f-3925-4a36-ada7-865559c7a39d-00000cef</instra:tracking.ecid>
            <instra:tracking.FlowEventId xmlns:instra="http://xmlns.oracle.com/sca/tracking/1.0">30174</instra:tracking.FlowEventId>
            <instra:tracking.FlowId xmlns:instra="http://xmlns.oracle.com/sca/tracking/1.0">30019</instra:tracking.FlowId>
            <instra:tracking.CorrelationFlowId xmlns:instra="http://xmlns.oracle.com/sca/tracking/1.0">0000MrkmE9iFw000jzwkno1TfZTH00000L</instra:tracking.CorrelationFlowId>
            <instra:tracking.quiescing.SCAEntityId xmlns:instra="http://xmlns.oracle.com/sca/tracking/1.0">20016</instra:tracking.quiescing.SCAEntityId>
         </wsa:ReferenceParameters>
      </wsa:ReplyTo>
      <wsa:FaultTo>
         <wsa:Address>http://www.w3.org/2005/08/addressing/anonymous</wsa:Address>
      </wsa:FaultTo>
   </env:Header>
   <env:Body xmlns:wsa="http://www.w3.org/2005/08/addressing">
      <ns2:executarProcessoAnaliseCreditoResponse xmlns:ns2="http://www.telefonica.com.br/ProcessoAnaliseCredito/">
         <res1:PermiteHabilitacao xmlns:res1="http://www.telefonica.com.br/ResultadoProcessoAnaliseCredito">Error</res1:PermiteHabilitacao>
      </ns2:executarProcessoAnaliseCreditoResponse>
   </env:Body>
</soapenv:Envelope>


Com letras

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:proc="http://www.telefonica.com.br/ProcessoAnaliseCredito/" xmlns:par="http://www.telefonica.com.br/ParametrosProcessoAnaliseCredito">
   <soapenv:Header>
   <wsse:Security xmlns:wsse="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-secext-1.0.xsd">
         <wsse:UsernameToken wsu:Id="Id-0001427873415141-0000000076fdd541-1" xmlns:wsu="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd">
            <wsse:Username>weblogic</wsse:Username>
            <wsse:Password>welcome1</wsse:Password>
         </wsse:UsernameToken>
      </wsse:Security>
   </soapenv:Header>
   <soapenv:Body>
      <proc:executarProcessoAnaliseCreditoRequest>
         <par:cliente>
            <par:documento>
               <par:cpf>asdf</par:cpf>
            </par:documento>
         </par:cliente>
      </proc:executarProcessoAnaliseCreditoRequest>
   </soapenv:Body>
</soapenv:Envelope>


<soapenv:Envelope xmlns:env="http://schemas.xmlsoap.org/soap/envelope/" xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/">
   <env:Header xmlns:wsa="http://www.w3.org/2005/08/addressing">
      <wsa:MessageID>urn:05e2d418-f460-11e9-b5c4-56847afe9799</wsa:MessageID>
      <wsa:ReplyTo>
         <wsa:Address>http://www.w3.org/2005/08/addressing/anonymous</wsa:Address>
         <wsa:ReferenceParameters>
            <instra:tracking.ecid xmlns:instra="http://xmlns.oracle.com/sca/tracking/1.0">3c54df9f-3925-4a36-ada7-865559c7a39d-00000d42</instra:tracking.ecid>
            <instra:tracking.FlowEventId xmlns:instra="http://xmlns.oracle.com/sca/tracking/1.0">30202</instra:tracking.FlowEventId>
            <instra:tracking.FlowId xmlns:instra="http://xmlns.oracle.com/sca/tracking/1.0">30021</instra:tracking.FlowId>
            <instra:tracking.CorrelationFlowId xmlns:instra="http://xmlns.oracle.com/sca/tracking/1.0">0000MrkmgvaFw000jzwkno1TfZTH00000N</instra:tracking.CorrelationFlowId>
            <instra:tracking.quiescing.SCAEntityId xmlns:instra="http://xmlns.oracle.com/sca/tracking/1.0">20016</instra:tracking.quiescing.SCAEntityId>
         </wsa:ReferenceParameters>
      </wsa:ReplyTo>
      <wsa:FaultTo>
         <wsa:Address>http://www.w3.org/2005/08/addressing/anonymous</wsa:Address>
      </wsa:FaultTo>
   </env:Header>
   <env:Body xmlns:wsa="http://www.w3.org/2005/08/addressing">
      <ns2:executarProcessoAnaliseCreditoResponse xmlns:ns2="http://www.telefonica.com.br/ProcessoAnaliseCredito/">
         <res1:PermiteHabilitacao xmlns:res1="http://www.telefonica.com.br/ResultadoProcessoAnaliseCredito">Error</res1:PermiteHabilitacao>
      </ns2:executarProcessoAnaliseCreditoResponse>
   </env:Body>
</soapenv:Envelope>